MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rng.c
/* Private types -----------------------------------------------------------------------------------------------------*/
/* Private defines ---------------------------------------------------------------------------------------------------*/
/* Private variables -------------------------------------------------------------------------------------------------*/
/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup RNG_Private_Macros RNG Private Macros
  * @{
  */
/*! Check the clock divider */
#define IS_RNG_CLOCK_DIVIDER(clock_div)               \
  (((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_1)        \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_2)     \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_4)     \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_8)     \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_16)    \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_32)    \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_64)    \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_128)   \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_256)   \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_512)   \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_1024)  \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_2048)  \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_4096)  \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_8192)  \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_16384) \
   || ((clock_div) == HAL_RNG_CLOCK_DIVIDER_BY_32768))

/*! Check the NIST Compliance parameters */
#define IS_RNG_STANDARD(standard) \
  (((standard) == HAL_RNG_NIST) || ((standard) == HAL_RNG_CUSTOM))

/*! Check config_1 parameter */
#define IS_RNG_CONFIG1(config1) ((config1) <= 0xFFUL)

/*! Check config_2 parameter */
#define IS_RNG_CONFIG2(config2) ((config2) <= 0x07UL)

/*! Check config_3 parameter */
#define IS_RNG_CONFIG3(config3) ((config3) <= 0xFUL)

/*! Check noise source parameter */
#define IS_RNG_NOISE_SOURCE(noise_src)                                            \
  ((((noise_src) & (HAL_RNG_OSCILLATOR_SOURCE_1 | HAL_RNG_OSCILLATOR_SOURCE_2     \
                    | HAL_RNG_OSCILLATOR_SOURCE_3)) != 0x00U)                     \
   && (((noise_src) & ~(HAL_RNG_OSCILLATOR_SOURCE_1 | HAL_RNG_OSCILLATOR_SOURCE_2 \
                        | HAL_RNG_OSCILLATOR_SOURCE_3)) == 0x0U))

/*! Check RNG clock error detection */
#define IS_RNG_CED(rng_ced) \
  (((rng_ced) == HAL_RNG_CLOCK_ERROR_DETECTION_ENABLED) || ((rng_ced) == HAL_RNG_CLOCK_ERROR_DETECTION_DISABLED))
/*! Check RNG additional health test register index */
#define IS_RNG_HTCR_INDEX(idx) \
  (((idx) == HAL_RNG_HTCR1 ) \
   || ((idx) == HAL_RNG_HTCR2 ) \
   || ((idx) == HAL_RNG_HTCR3 ))

/*! Check RNG additional health test value */
#define IS_RNG_HTCR_VALUE(value) ((value) <= (0x3FFFF))
/*! Convert the HAL RNG instance into CMSIS RNG instance */
#define RNG_GET_INSTANCE(handle) ((RNG_TypeDef *)(uint32_t)(handle)->instance)
/**
  * @}
  */

/* Private constants--------------------------------------------------------------------------------------------------*/
/** @defgroup RNG_Private_Constants RNG Private Constants
  * @{
  */
#define  RNG_SEED_ERROR_RECOVER_TRIALS  4U           /*!< RNG recover trial value            */
#define  RNG_CONDRST_TIMEOUT_MS         1U           /*!< RNG CONDRST timeout in milliseconds */
#define  RNG_CONFIGLOCK_TIMEOUT_MS      1U           /*!< RNG CONFIG lock timeout in milliseconds */
#define  RNG_BUSY_TIMEOUT_MS            1U           /*!< RNG BUSY timeout in millisecond    */
#define  RNG_CONFIG_1_MASK              0x0FF00000UL /*!< RNG config1 mask                   */
#define  RNG_CONFIG_2_MASK              0x0000E000UL /*!< RNG config2 mask                   */
#define  RNG_CONFIG_3_MASK              0x00000F00UL /*!< RNG config3 mask                   */
#define  RNG_NIST_MASK                  0x00000001UL /*!< RNG NIST mask                      */
#define  RNG_CED_MASK                   0x00000001UL /*!< RNG CED mask                       */
#define  RNG_CLKDIV_MASK                0x000F0000UL /*!< RNG CLK divider mask               */
/**
  * @}
  */

/* Private functions prototypes --------------------------------------------------------------------------------------*/
/** @defgroup RNG_Private_Functions RNG Private Functions
  * @{
  */
static hal_status_t RNG_WaitOnFlagUntilTimeout(hal_rng_handle_t *hrng);
static hal_status_t RNG_WaitOnBusyFlagUntilTimeout(hal_rng_handle_t *hrng);
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup RNG_Exported_Functions
  * @{
  */

/** @addtogroup RNG_Exported_Functions_Group1
  * @{
This subsection provides a set of functions that allow you to initialize and de-initialize the RNG peripheral:
- HAL_RNG_Init() to initialize the selected HAL RNG handle and associate an RNG peripheral instance.
- HAL_RNG_DeInit() to de-initialize the given HAL RNG instance and reset the state machine.
  */

/**
  * @brief  Initialize the RNG handle and associate an instance.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @param  instance          one of the values of the enumeration @ref hal_rng_t.
  * @retval HAL_OK            RNG handle has been correctly initialized.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_Init(hal_rng_handle_t *hrng, hal_rng_t instance)
{
  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(IS_RNG_ALL_INSTANCE((RNG_TypeDef *)(uint32_t)instance));

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
    || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  hrng->instance = instance;

#if defined(USE_HAL_RNG_REGISTER_CALLBACKS) && (USE_HAL_RNG_REGISTER_CALLBACKS == 1)
  hrng->p_generation_cplt_cb = HAL_RNG_GenerationCpltCallback;
  hrng->p_error_cb           = HAL_RNG_ErrorCallback;
#endif /* USE_HAL_RNG_REGISTER_CALLBACKS */

  hrng->p_data = NULL;
  hrng->count  = 0U;

