MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rng.c
#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
  hrng->last_error_codes = HAL_RNG_ERROR_NONE;
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */

#if defined (USE_HAL_RNG_USER_DATA) && (USE_HAL_RNG_USER_DATA == 1)
  hrng->p_user_data = NULL;
#endif /* USE_HAL_RNG_USER_DATA */

#if defined (USE_HAL_RNG_CLK_ENABLE_MODEL) && (USE_HAL_RNG_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_RNG_EnableClock();
#endif /* USE_HAL_RNG_CLK_ENABLE_MODEL */

  hrng->global_state = HAL_RNG_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  DeInitialize the RNG peripheral.
  * @param  hrng pointer to @ref hal_rng_handle_t structure.
  */
void HAL_RNG_DeInit(hal_rng_handle_t *hrng)
{
  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(IS_RNG_ALL_INSTANCE(RNG_GET_INSTANCE(hrng)));

  LL_RNG_Disable(RNG_GET_INSTANCE(hrng));

  hrng->global_state = HAL_RNG_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup RNG_Exported_Functions_Group2
  * @{
This subsection provides a set of APIs to configure the RNG peripheral:
- HAL_RNG_SetConfig() sets the configuration of the RNG peripheral.
- HAL_RNG_SetCandidateNISTConfig() sets the RNG peripheral within a candidate NIST compliant configuration.
- HAL_RNG_SetCandidateGermanBSIConfig() sets the RNG peripheral within a candidate German BSI compliant configuration.
- HAL_RNG_GetConfig() retrieves the RNG peripheral configuration.
- HAL_RNG_EnableClockErrorDetection() enables the clock error detection feature.
- HAL_RNG_DisableClockErrorDetection() disables the clock error detection feature.
- HAL_RNG_IsEnabledClockErrorDetection() checks whether the clock error detection feature is enabled.
- HAL_RNG_EnableAutoReset() enables the auto reset feature.
- HAL_RNG_DisableAutoReset() disables the auto reset feature.
- HAL_RNG_IsEnabledAutoReset() checks whether the auto reset feature is enabled.
- HAL_RNG_SetClockDivider() sets the clock divider.
- HAL_RNG_GetClockDivider() retrieves the clock divider value.
  */

/**
  * @brief  Configure the RNG with the specified parameters in the @ref hal_rng_config_t.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @param  p_config          pointer to @ref hal_rng_config_t structure.
  * @retval HAL_OK            configuration succeeded.
  * @retval HAL_ERROR         configuration fail.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_SetConfig(hal_rng_handle_t *hrng, const hal_rng_config_t *p_config)
{
  RNG_TypeDef *p_rngx;
  uint32_t config;
  uint32_t noise_source;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(IS_RNG_CONFIG1(p_config->config_1));
  ASSERT_DBG_PARAM(IS_RNG_CONFIG2(p_config->config_2));
  ASSERT_DBG_PARAM(IS_RNG_CONFIG3(p_config->config_3));
  ASSERT_DBG_PARAM(IS_RNG_CLOCK_DIVIDER(p_config->clock_divider));
  ASSERT_DBG_PARAM(IS_RNG_STANDARD(p_config->standard));
  ASSERT_DBG_PARAM(IS_RNG_CED(p_config->clock_error_detection));
  ASSERT_DBG_PARAM(IS_RNG_NOISE_SOURCE(p_config->noise_src.osc_1_src));
  ASSERT_DBG_PARAM(IS_RNG_NOISE_SOURCE(p_config->noise_src.osc_2_src));
  ASSERT_DBG_PARAM(IS_RNG_NOISE_SOURCE(p_config->noise_src.osc_3_src));

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_INIT | (uint32_t)HAL_RNG_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_config == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx  = RNG_GET_INSTANCE(hrng);

  config = ((p_config->config_1  << RNG_CR_RNG_CONFIG1_Pos) | (p_config->config_2  << RNG_CR_RNG_CONFIG2_Pos) \
            | (p_config->config_3 << RNG_CR_RNG_CONFIG3_Pos) | ((uint32_t)p_config->clock_divider)            \
            | ((uint32_t)p_config->clock_error_detection) | ((uint32_t)p_config->standard));

  noise_source = (((uint32_t)p_config->noise_src.osc_1_src << RNG_NSCR_EN_OSC1_Pos)   \
                  | ((uint32_t)p_config->noise_src.osc_2_src << RNG_NSCR_EN_OSC2_Pos) \
                  | ((uint32_t)p_config->noise_src.osc_3_src << RNG_NSCR_EN_OSC3_Pos));
  if (LL_RNG_IsConfigLocked(p_rngx) == 0U)
  {
    if (RNG_WaitOnBusyFlagUntilTimeout(hrng) == HAL_OK)
    {
      LL_RNG_SetConfig(p_rngx, config);
      LL_RNG_WRITE_REG(p_rngx, NSCR, noise_source);
      LL_RNG_SetHealthConfig(p_rngx, (uint32_t)(p_config->health_test));
      LL_RNG_DisableCondReset(p_rngx);
      status = RNG_WaitOnFlagUntilTimeout(hrng);
    }
  }
  return status;
}


/**
  * @brief  Configure the RNG with the candidate NIST compliant configuration.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK            configuration succeeded.
  * @retval HAL_ERROR         configuration fail.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_SetCandidateNISTConfig(hal_rng_handle_t *hrng)
{
  RNG_TypeDef *p_rngx;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_INIT | (uint32_t)HAL_RNG_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx = RNG_GET_INSTANCE(hrng);

  if (LL_RNG_IsConfigLocked(p_rngx) == 0U)
  {
    if (RNG_WaitOnBusyFlagUntilTimeout(hrng) == HAL_OK)
    {
      /* Apply Candidate NIST configuration */
      LL_RNG_WRITE_REG(p_rngx, CR, ((uint32_t)RNG_CAND_NIST_CR_VALUE | (uint32_t)RNG_CR_CONDRST));
      LL_RNG_WRITE_REG(p_rngx, NSCR, RNG_CAND_NIST_NSCR_VALUE);
      LL_RNG_WRITE_REG(p_rngx, HTCR[0], RNG_CAND_NIST_HTCR_VALUE);
      LL_RNG_DisableCondReset(p_rngx);

      status = RNG_WaitOnFlagUntilTimeout(hrng);
    }
  }
  return status;
}

/**
  * @brief  Configure the RNG with the candidate German BSI compliant configuration.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK            configuration succeeded.
  * @retval HAL_ERROR         configuration fail.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_SetCandidateGermanBSIConfig(hal_rng_handle_t *hrng)
{
  RNG_TypeDef *p_rngx;
  hal_status_t status = HAL_ERROR;

  ASSERT_DBG_PARAM(hrng != NULL);

