MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rng.c
  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_INIT | (uint32_t)HAL_RNG_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx = RNG_GET_INSTANCE(hrng);
  if (LL_RNG_IsConfigLocked(p_rngx) == 0U)
  {
    if (RNG_WaitOnBusyFlagUntilTimeout(hrng) == HAL_OK)
    {
      /* Apply Candidate GermanBSI configuration */
      LL_RNG_WRITE_REG(p_rngx, CR, ((uint32_t)RNG_CAND_GermanBSI_CR_VALUE | (uint32_t)RNG_CR_CONDRST));
      LL_RNG_WRITE_REG(p_rngx, NSCR, RNG_CAND_GermanBSI_NSCR_VALUE);
      LL_RNG_WRITE_REG(p_rngx, HTCR[0], RNG_CAND_GermanBSI_HTCR_VALUE);
      LL_RNG_DisableCondReset(p_rngx);

      status = RNG_WaitOnFlagUntilTimeout(hrng);
    }
  }
  return status;
}
/**
  * @brief  Configure the RNG additional health tests.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @param  htcr_idx          is a value of the  @ref hal_rng_htcr_idx_t enumeration.
  * @param  htcr_value        Health test value.
  * @retval HAL_OK            configuration succeeded.
  * @retval HAL_ERROR         configuration fail.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t   HAL_RNG_SetHealthFactorConfig(hal_rng_handle_t *hrng, hal_rng_htcr_idx_t htcr_idx, uint32_t htcr_value)
{
  RNG_TypeDef *p_rngx;
  hal_status_t status = HAL_ERROR;
  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(IS_RNG_HTCR_INDEX(htcr_idx));
  ASSERT_DBG_PARAM(IS_RNG_HTCR_VALUE(htcr_value));
  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1))\
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (htcr_value > (uint32_t) 0x3FFFF)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */
  p_rngx = RNG_GET_INSTANCE(hrng);
  if (LL_RNG_IsConfigLocked(p_rngx) == 0U)
  {
    LL_RNG_EnableCondReset(p_rngx);
    LL_RNG_SetHealthFactorConfig(p_rngx, (uint32_t) htcr_idx, htcr_value);
    LL_RNG_DisableCondReset(p_rngx);

    status = RNG_WaitOnFlagUntilTimeout(hrng);
  }
  return status;
}
/**
  * @brief  Get RNG  additional health tests config.
  * @param  hrng                    pointer to @ref hal_rng_handle_t structure.
  * @param  htcr_idx                is a value of the  @ref hal_rng_htcr_idx_t enumeration.
  * @retval factor_config           uint32_t additional health test value between 0x0 and 0xFFFF.
  */
uint32_t HAL_RNG_GetHealthFactorConfig(const hal_rng_handle_t *hrng, hal_rng_htcr_idx_t htcr_idx)
{
  RNG_TypeDef *p_rngx;
  uint32_t factor_config;
  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(IS_RNG_HTCR_INDEX(htcr_idx));
  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE | (uint32_t) HAL_RNG_STATE_ACTIVE \
                   | (uint32_t) HAL_RNG_STATE_ERROR);
  p_rngx     = RNG_GET_INSTANCE(hrng);
  factor_config = LL_RNG_GetHealthFactorConfig(p_rngx, (uint32_t) htcr_idx);
  return factor_config;
}
/**
  * @brief  Get the RNG configuration and fill parameters in the @ref hal_rng_config_t.
  * @param  hrng     pointer to @ref hal_rng_handle_t structure.
  * @param  p_config pointer to @ref hal_rng_config_t structure.
  *                  module
  */
void HAL_RNG_GetConfig(const hal_rng_handle_t *hrng, hal_rng_config_t *p_config)
{
  RNG_TypeDef *p_rngx;
  uint32_t config_reg;
  uint32_t noise_source;

  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE | (uint32_t) HAL_RNG_STATE_ACTIVE \
                   | (uint32_t) HAL_RNG_STATE_ERROR);

  p_rngx     = RNG_GET_INSTANCE(hrng);
  config_reg = LL_RNG_GetConfig(p_rngx);
  noise_source  = LL_RNG_READ_REG(p_rngx, NSCR);

  p_config->config_1              = (config_reg & RNG_CONFIG_1_MASK) >> RNG_CR_RNG_CONFIG1_Pos;
  p_config->config_2              = (config_reg & RNG_CONFIG_2_MASK) >> RNG_CR_RNG_CONFIG2_Pos;
  p_config->config_3              = (config_reg & RNG_CONFIG_3_MASK) >> RNG_CR_RNG_CONFIG3_Pos;
  p_config->clock_divider         = (hal_rng_clock_divider_t)(uint32_t)(config_reg & RNG_CR_CLKDIV_Msk);
  p_config->standard              = (hal_rng_standard_t)(uint32_t)(config_reg & (RNG_NIST_MASK << RNG_CR_NISTC_Pos));
  p_config->clock_error_detection = (hal_rng_clock_error_detection_status_t)   \
                                    (uint32_t)(config_reg & (RNG_CED_MASK << RNG_CR_CED_Pos));
  p_config->health_test           = LL_RNG_GetHealthConfig(p_rngx);
  p_config->noise_src.osc_1_src   = (uint8_t)((noise_source & RNG_NSCR_EN_OSC1_Msk) >> RNG_NSCR_EN_OSC1_Pos);
  p_config->noise_src.osc_2_src   = (uint8_t)((noise_source & RNG_NSCR_EN_OSC2_Msk) >> RNG_NSCR_EN_OSC2_Pos);
  p_config->noise_src.osc_3_src   = (uint8_t)((noise_source & RNG_NSCR_EN_OSC3_Msk) >> RNG_NSCR_EN_OSC3_Pos);
}

/**
  * @brief  Enable the clock error detection feature.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK            configuration succeeded.
  * @retval HAL_ERROR         configuration fail.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_EnableClockErrorDetection(hal_rng_handle_t *hrng)
{
  RNG_TypeDef *p_rngx;

  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx = RNG_GET_INSTANCE(hrng);

  if (LL_RNG_IsConfigLocked(p_rngx) != 0U)
  {
    return HAL_ERROR;
  }

  LL_RNG_EnableClkErrorDetect(p_rngx);

  return HAL_OK;
}

/**
  * @brief  Disable the clock error detection feature.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK            configuration succeeded.
  * @retval HAL_ERROR         configuration fail.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_DisableClockErrorDetection(hal_rng_handle_t *hrng)
{
  RNG_TypeDef *p_rngx;

  ASSERT_DBG_PARAM(hrng != NULL);

