MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rng.c
  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx = RNG_GET_INSTANCE(hrng);

  if (LL_RNG_IsConfigLocked(p_rngx) != 0U)
  {
    return HAL_ERROR;
  }

  LL_RNG_DisableClkErrorDetect(p_rngx);

  return HAL_OK;
}

/**
  * @brief  Check the clock error detection status.
  * @param  hrng                                  pointer to @ref hal_rng_handle_t structure.
  * @retval hal_rng_clock_error_detection_status_t error detection state.
  */
hal_rng_clock_error_detection_status_t HAL_RNG_IsEnabledClockErrorDetection(const hal_rng_handle_t *hrng)
{
  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE | (uint32_t) HAL_RNG_STATE_ACTIVE \
                   | (uint32_t) HAL_RNG_STATE_ERROR);

  return ((hal_rng_clock_error_detection_status_t)
          (uint32_t)(((~LL_RNG_IsEnabledClkErrorDetect(RNG_GET_INSTANCE(hrng))) & RNG_CED_MASK) << RNG_CR_CED_Pos));
}

/**
  * @brief  Enable the automatic reset.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK            auto-reset enabled successfully.
  * @retval HAL_ERROR         fail to enable the auto-reset.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_EnableAutoReset(hal_rng_handle_t *hrng)
{
  RNG_TypeDef *p_rngx;

  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx = RNG_GET_INSTANCE(hrng);

  if (LL_RNG_IsConfigLocked(p_rngx) != 0U)
  {
    return HAL_ERROR;
  }

  LL_RNG_EnableArdis(p_rngx);

  return HAL_OK;
}

/**
  * @brief  Disable the auto reset.
  * @param  hrng pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK            auto-reset disabled successfully.
  * @retval HAL_ERROR         fail to disable the auto-reset.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_DisableAutoReset(hal_rng_handle_t *hrng)
{
  RNG_TypeDef *p_rngx;

  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx = RNG_GET_INSTANCE(hrng);

  if (LL_RNG_IsConfigLocked(p_rngx) != 0U)
  {
    return HAL_ERROR;
  }

  LL_RNG_DisableArdis(p_rngx);

  return HAL_OK;
}

/**
  * @brief  Check the status of the auto reset.
  * @param  hrng                       pointer to @ref hal_rng_handle_t structure.
  * @retval hal_rng_auto_reset_status_t auto-reset state
  */
hal_rng_auto_reset_status_t HAL_RNG_IsEnabledAutoReset(const hal_rng_handle_t *hrng)
{
  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE | (uint32_t) HAL_RNG_STATE_ACTIVE \
                   | (uint32_t) HAL_RNG_STATE_ERROR);

  return ((hal_rng_auto_reset_status_t)LL_RNG_IsEnabledArdis(RNG_GET_INSTANCE(hrng)));
}

/**
  * @brief  Set RNG  Clock divider factor.
  * @param  hrng        pointer to @ref hal_rng_handle_t structure.
  * @param  clk_divider is a value of the @ref hal_rng_clock_divider_t enumeration.
  * @retval HAL_OK            clock divider set successfully.
  * @retval HAL_ERROR         fail to set the clock divider.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_SetClockDivider(hal_rng_handle_t *hrng, hal_rng_clock_divider_t clk_divider)
{
  RNG_TypeDef *p_rngx;

  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(IS_RNG_CLOCK_DIVIDER(clk_divider));

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx = RNG_GET_INSTANCE(hrng);

  if (LL_RNG_IsConfigLocked(p_rngx) != 0U)
  {
    return HAL_ERROR;
  }

  LL_RNG_SetClockDivider(p_rngx, (uint32_t) clk_divider);

  return HAL_OK;
}

/**
  * @brief  Get RNG  Clock divider factor.
  * @param  hrng                    pointer to @ref hal_rng_handle_t structure.
  * @retval hal_rng_clock_divider_t Clock divider.
  */
hal_rng_clock_divider_t HAL_RNG_GetClockDivider(const hal_rng_handle_t *hrng)
{
  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE | (uint32_t) HAL_RNG_STATE_ACTIVE \
                   | (uint32_t) HAL_RNG_STATE_ERROR);

  return ((hal_rng_clock_divider_t) LL_RNG_GetClockDivider(RNG_GET_INSTANCE(hrng)));
}
/**
  * @}
  */

/** @addtogroup RNG_Exported_Functions_Group3
  * @{
This subsection provides a set of APIs to generate random numbers in polling and interrupt modes:
- HAL_RNG_GenerateRandomNumber() generates N random number words in polling mode.
- HAL_RNG_GenerateRandomNumber_IT() generates N random number words in interrupt mode.
- HAL_RNG_IRQHandler() handles RNG interrupt requests.
  */
/**
  * @brief   Generate N 32-bit random numbers in polling mode.
  * @param   hrng              pointer to @ref hal_rng_handle_t structure.
  * @param   p_data            pointer to be filled with random number.
  * @param   size_word         total number of random numbers to be generated.
  * @param   timeout_ms        timeout in milliseconds.
  * @retval  HAL_OK            random numbers are generated successfully.
  * @retval  HAL_ERROR         seed error occurred when generating random numbers.
  * @retval  HAL_TIMEOUT       timeout occurred when generating random numbers.
  * @retval  HAL_BUSY          process is already ongoing.
  * @retval  HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_GenerateRandomNumber(hal_rng_handle_t *hrng, uint32_t *p_data, uint32_t size_word,
                                          uint32_t timeout_ms)
{
  uint32_t *p_temp;
  uint32_t count;
  uint32_t tickstart;
  RNG_TypeDef *p_rngx;

  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_word > 0U);
  ASSERT_DBG_PARAM(timeout_ms > 0U);

