MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rng.c
  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1))\
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_data == NULL) || (size_word == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hrng == NULL) || (timeout_ms == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hrng, global_state, HAL_RNG_STATE_IDLE, HAL_RNG_STATE_ACTIVE);

#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
  hrng->last_error_codes = HAL_RNG_ERROR_NONE;
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */

  count     = size_word;
  p_temp    = p_data;
  tickstart = HAL_GetTick();
  p_rngx    = RNG_GET_INSTANCE(hrng);

  LL_RNG_Enable(p_rngx);

  while (((HAL_GetTick() - tickstart) < timeout_ms) && (count != 0U))
  {
    if (LL_RNG_IsActiveFlag_SEIS(p_rngx) != 0U)
    {
      if (LL_RNG_IsActiveFlag_SECS(p_rngx) == 0U)
      {
        /* RNG IP performed the reset automatically (auto-reset) */
        LL_RNG_ClearFlag_SEIS(p_rngx);
      }
      else
      {
#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
        hrng->last_error_codes = HAL_RNG_ERROR_SEED;
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */
        LL_RNG_Disable(p_rngx);
        hrng->global_state = HAL_RNG_STATE_ERROR;
        return HAL_ERROR;
      }
    }
    /* When a clock error is detected, update the last error code, clear the flag and continue the process operation */
    if (LL_RNG_IsActiveFlag_CEIS(p_rngx) != 0U)
    {
#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
      hrng->last_error_codes = HAL_RNG_ERROR_CLOCK;
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */

      LL_RNG_ClearFlag_CEIS(p_rngx);
    }

    while ((LL_RNG_IsActiveFlag_DRDY(p_rngx) != 0U) && (count != 0U))
    {
      *p_temp = LL_RNG_ReadRandData32(p_rngx);
      p_temp++;
      count--;

      if (count == 0U)
      {
        LL_RNG_Disable(p_rngx);
      }
    }
  }

  if ((HAL_GetTick() - tickstart) >= timeout_ms)
  {
    LL_RNG_Disable(p_rngx);
    hrng->global_state = HAL_RNG_STATE_IDLE;
    return HAL_TIMEOUT;
  }

  hrng->global_state = HAL_RNG_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Generate a N x 32-bit random number in interrupt mode.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @param  p_data            pointer to be filled with random number.
  * @param  size_word         total number of random number to be generated.
  * @retval HAL_OK            32-bit random number generated successfully.
  * @retval HAL_BUSY          process is already ongoing.
  * @retval HAL_INVALID_PARAM invalid parameter.
  */
hal_status_t HAL_RNG_GenerateRandomNumber_IT(hal_rng_handle_t *hrng, uint32_t *p_data, uint32_t size_word)
{
  RNG_TypeDef *p_rngx;

  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(p_data != NULL);
  ASSERT_DBG_PARAM(size_word > 0U);
  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_data == NULL) || (size_word == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hrng, global_state, HAL_RNG_STATE_IDLE, HAL_RNG_STATE_ACTIVE);

  /* Set process information */
  hrng->p_data = p_data;
  hrng->count  = size_word;
  p_rngx       = RNG_GET_INSTANCE(hrng);

  /* Enable the RNG interrupts */
  LL_RNG_EnableIT(p_rngx);
  LL_RNG_Enable(p_rngx);

  return HAL_OK;
}

/**
  * @brief  Handle the RNG interrupt request.
  * @param  hrng pointer to @ref hal_rng_handle_t structure.
  */
void HAL_RNG_IRQHandler(hal_rng_handle_t *hrng)
{
  RNG_TypeDef *p_rngx;
  uint32_t itflags;

  ASSERT_DBG_PARAM(hrng != NULL);

  p_rngx  = RNG_GET_INSTANCE(hrng);
  itflags = LL_RNG_READ_REG(p_rngx, SR);

  if ((itflags & RNG_SR_CEIS) != 0U)
  {
#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
    hrng->last_error_codes |= HAL_RNG_ERROR_CLOCK;
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */
    LL_RNG_ClearFlag_CEIS(p_rngx);
  }

  if ((itflags & RNG_SR_SEIS)  != 0U)
  {
    if ((itflags & RNG_SR_SECS) == 0U)
    {
      /* RNG IP performed the reset automatically (auto-reset) */
      LL_RNG_ClearFlag_SEIS(p_rngx);
    }
    else
    {
      LL_RNG_DisableIT(p_rngx);
      LL_RNG_Disable(p_rngx);

#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
      /* Seed Error has not been recovered : Update the error code */
      hrng->last_error_codes |= HAL_RNG_ERROR_SEED;
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */

      hrng->global_state = HAL_RNG_STATE_ERROR;
    }
  }

  if ((itflags & (RNG_SR_SEIS | RNG_SR_CEIS)) != 0U)
  {
#if defined (USE_HAL_RNG_REGISTER_CALLBACKS) && (USE_HAL_RNG_REGISTER_CALLBACKS == 1)
    hrng->p_error_cb(hrng);
#else
    HAL_RNG_ErrorCallback(hrng);
#endif /* USE_HAL_RNG_REGISTER_CALLBACKS */

    if ((itflags & RNG_SR_SEIS) != 0U)
    {
      return;
    }
  }

  /* Wait until DRDY flag is set */
  while ((LL_RNG_IsActiveFlag_DRDY(p_rngx) != 0U))
  {
    /* Read 32-bit random data from RNDATA register */
    *hrng->p_data = LL_RNG_ReadRandData32(p_rngx);
    hrng->p_data++;
    hrng->count--;

    if (hrng->count == 0U)
    {
      LL_RNG_DisableIT(p_rngx);
      LL_RNG_Disable(p_rngx);
      hrng->global_state = HAL_RNG_STATE_IDLE;
#if defined (USE_HAL_RNG_REGISTER_CALLBACKS) && (USE_HAL_RNG_REGISTER_CALLBACKS == 1)
      hrng->p_generation_cplt_cb(hrng);
#else
      HAL_RNG_GenerationCpltCallback(hrng);
#endif /* USE_HAL_RNG_REGISTER_CALLBACKS */
      break;
    }
  }
}
/**
  * @}
  */

/** @addtogroup RNG_Exported_Functions_Group4
  * @{
This subsection provides the RNG recover from seed error function :
- HAL_RNG_RecoverSeedError() recover seed error when occurs.
  */
/**
  * @brief  Recover the RNG sequence when a seed error occurs.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK            operation succeeded
  * @retval HAL_ERROR         operation failed
  * @retval HAL_INVALID_PARAM invalid parameter.
  * @warning Recover from seed error will adapt the parameters config1,2,3 to overcome seed error.
  */
hal_status_t HAL_RNG_RecoverSeedError(hal_rng_handle_t *hrng)
{
  uint32_t tickstart1 = 0U;
  uint32_t tickstart2 = 0U;
  uint32_t oscillators_count = 0U;
  uint32_t timeout;
  uint32_t htsr_temp = 0U;
  uint32_t htsr_previous_temp = 0U;
  uint32_t htsr_count = 0U;
  uint32_t nsmr_temp = 0U;
  uint32_t config_b_fewer_than_6_osc_count = 0U;
  uint8_t count = 0U;
  RNG_TypeDef *p_rngx;

  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_ERROR);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  p_rngx  = RNG_GET_INSTANCE(hrng);

