MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rng.c
  /* timeout here is an empirical value */
  timeout = (1UL + ((1UL << (LL_RNG_GetClockDivider(p_rngx) >> 16UL)) * RNG_BUSY_TIMEOUT_MS / 4UL));
  LL_RNG_Enable(p_rngx);

  tickstart1 = HAL_GetTick();
  /* Check if seed error current status indicates no error and auto-reset succeeded */
  if (LL_RNG_IsActiveFlag_SECS(p_rngx) == 0U)
  {
    /* Clear SEIS flag when automatic reset is activated */
    LL_RNG_ClearFlag_SEIS(p_rngx);
  }
  else  /* Sequence to fully recover from a seed error*/
  {

    if (LL_RNG_IsConfigLocked(p_rngx) == 0U)
    {
      do
      {
        if (LL_RNG_IsActiveFlag_SECS(p_rngx) == 0UL)
        {
          break;
        }
        /* Read oscillator status registers combined */
        htsr_temp = LL_RNG_GetHealthTestStatus(p_rngx, 0U);
        htsr_temp |= LL_RNG_GetHealthTestStatus(p_rngx, 1U);
        if (htsr_temp > 0U)
        {
          /* If any oscillator status bits overlap with previous status, increment counter */
          if ((htsr_temp & htsr_previous_temp) != 0U)
          {
            htsr_count++;
          }
          if (htsr_count > 3U)
          {
            /* if the same repetitive or adaptive error is detected 3 times */
            nsmr_temp = LL_RNG_GetNoiseSourceMask(p_rngx);

            /* deactivate the same osc in each triple oscillator (Mask oscillators with the seed error by
               clearing bits shifted right by 1) */
            nsmr_temp = nsmr_temp & ~(htsr_temp >> 1U);

            /* Count the number of active oscillators in nsmr */
            oscillators_count = 0U;
            for (count = 0U; count < 9U; count++)
            {
              if (((nsmr_temp >> count) & 0x1U) != 0U)
              {
                /* increment count1 for each 1 in nsmr */
                oscillators_count++;
              }
            }
            if (oscillators_count < 6U)
            {
              /* If fewer than 6 oscillators remain active, unmask all oscillators --> Reset masking */
              nsmr_temp = LL_RNG_GetOscNoiseSrc(p_rngx, LL_RNG_NOISE_SRC_1 | LL_RNG_NOISE_SRC_2 | LL_RNG_NOISE_SRC_3);
              htsr_previous_temp = 0;
              htsr_count = 0U;
              if ((p_rngx->CR  & RNG_CR_CLKDIV_Msk) < ((uint32_t)RNG_CAND_NIST_CR_VALUE & RNG_CR_CLKDIV_Msk))

              {
                config_b_fewer_than_6_osc_count++;
              }
            }
            if (config_b_fewer_than_6_osc_count > 2U)
            {
              /* Reset RNG condition */
              LL_RNG_WRITE_REG(p_rngx, CR, (RNG_CR_CONDRST_Msk | (uint32_t)RNG_CAND_NIST_CR_VALUE));

              /* Update mask register with new oscillator mask */
              LL_RNG_SetNoiseSourceMask(p_rngx, nsmr_temp);

              /* Clear condition reset bit to resume operation */
              LL_RNG_DisableCondReset(p_rngx);
            }
            else
            {
              /* Reset RNG condition */
              LL_RNG_WRITE_REG(p_rngx, CR, (p_rngx->CR & ~RNG_CR_RNGEN_Msk) | RNG_CR_CONDRST_Msk);

              /* Update mask register with new oscillator mask */
              LL_RNG_SetNoiseSourceMask(p_rngx, nsmr_temp);

              /* Clear condition reset bit to resume operation */
              LL_RNG_DisableCondReset(p_rngx);
            }
          }

          else
          {
            /* Briefly toggle conditional reset to recover RNG */
            LL_RNG_WRITE_REG(p_rngx, CR, (p_rngx->CR & ~RNG_CR_RNGEN_Msk) | RNG_CR_CONDRST_Msk);

            /* unmask all oscillators to find another working condition */
            LL_RNG_SetNoiseSourceMask(p_rngx, LL_RNG_GetOscNoiseSrc(p_rngx, LL_RNG_OSC_1 | LL_RNG_OSC_2 \
                                                                    | LL_RNG_OSC_3));
            LL_RNG_DisableCondReset(p_rngx);
          }

          /* Wait until RNG is not busy */
          if (RNG_WaitOnBusyFlagUntilTimeout(hrng) != HAL_OK)
          {
            LL_RNG_Disable(p_rngx);
            hrng->global_state = HAL_RNG_STATE_ERROR;
            return HAL_ERROR;
          }

          /* No timeout --> Enable RNG */
          LL_RNG_Enable(p_rngx);
          tickstart2 = HAL_GetTick();
          do
          {
            if (LL_RNG_IsActiveFlag_DRDY(p_rngx) != 0UL)
            {
              break;
            }
            if ((HAL_GetTick() - tickstart2) > timeout)
            {
              /* New check to avoid false timeout detection in case of preemption */
              if (LL_RNG_IsActiveFlag_DRDY(p_rngx) == 0UL)
              {
                if (LL_RNG_IsActiveFlag_SECS(p_rngx) == 0UL)
                {
                  LL_RNG_Disable(p_rngx);
                  hrng->global_state = HAL_RNG_STATE_ERROR;
                  return HAL_ERROR;
                }

              }
            }
          } while (LL_RNG_IsActiveFlag_SECS(p_rngx) == 0UL);

          /* Accumulate seed error status bits */
          htsr_previous_temp = htsr_previous_temp | htsr_temp;
        }
      } while ((HAL_GetTick() - tickstart1) <= timeout);
    }
  }

  /*Check if seed error current status (SECS)is set */
  if (LL_RNG_IsActiveFlag_SECS(p_rngx) != 0U)
  {
#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
    hrng->last_error_codes &= HAL_RNG_ERROR_SEED;
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */
    return HAL_ERROR;
  }

  /* Update the error code */
#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
  hrng->last_error_codes &= ~ HAL_RNG_ERROR_SEED;
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */
  hrng->global_state = HAL_RNG_STATE_IDLE;
  return HAL_OK;
}
/**
  * @}
  */

/** @addtogroup RNG_Exported_Functions_Group5
  * @{
This subsection provides a set of RNG callback registration APIs:
- HAL_RNG_RegisterGenerationCpltCallback() register a callback function for interrupts when generation completes.
- HAL_RNG_RegisterErrorCallback() register a callback function for interrupts when an error occurs.
  */
/**
  * @brief  Handle the RNG error callback.
  * @param  hrng pointer to @ref hal_rng_handle_t structure.
  */
__WEAK void HAL_RNG_ErrorCallback(hal_rng_handle_t *hrng)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hrng);
  /* Warning: This function must not be modified. When the callback is needed,
    *           function HAL_RNG_ErrorCallback must be implemented in the user file.
    */
}

/**
  * @brief  Handle the Random number generation complete callback in non-blocking mode.
  * @param  hrng pointer to @ref hal_rng_handle_t structure.
  */
__WEAK void HAL_RNG_GenerationCpltCallback(hal_rng_handle_t *hrng)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hrng);
  /* Warning: This function must not be modified. When the callback is needed,
    *           function HAL_RNG_GenerationCpltCallback must be implemented in the user file.
    */
}

#if defined (USE_HAL_RNG_REGISTER_CALLBACKS) && (USE_HAL_RNG_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register random number RNG generation complete callback. \n
  *         To be used instead of the weak HAL_RNG_GenerationCpltCallback().
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @param  callback          pointer to the random number Ready callback function.
  * @retval HAL_OK            succeeded.
  * @retval HAL_INVALID_PARAM invalid callback.
  */
hal_status_t HAL_RNG_RegisterGenerationCpltCallback(hal_rng_handle_t *hrng, hal_rng_cb_t callback)
{

  ASSERT_DBG_PARAM((hrng != NULL));
  ASSERT_DBG_PARAM((callback != NULL));

#if (defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

