MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_rng.c
  hrng->p_generation_cplt_cb = callback;

  return HAL_OK;
}

/**
  * @brief  Register a User RNG callback. \n
  *         To be used instead of the weak HAL_RNG_RegisterErrorCallback.
  * @param  hrng              pointer to @ref hal_rng_handle_t structure.
  * @param  callback          pointer to the callback function
  * @retval HAL_OK            succeeded.
  * @retval HAL_INVALID_PARAM invalid callback.
  */
hal_status_t HAL_RNG_RegisterErrorCallback(hal_rng_handle_t *hrng, hal_rng_cb_t callback)
{
  ASSERT_DBG_PARAM((hrng != NULL));
  ASSERT_DBG_PARAM((callback != NULL));

#if (defined (USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  hrng->p_error_cb = callback;

  return HAL_OK;
}
#endif /* USE_HAL_RNG_REGISTER_CALLBACKS */
/**
  * @}
  */

#if defined (USE_HAL_RNG_USER_DATA) && (USE_HAL_RNG_USER_DATA == 1)
/** @addtogroup RNG_Exported_Functions_Group6
  * @{
This subsection provides a set of functions to set and get user data:
- HAL_RNG_SetUserData() store the user data pointer in the handle.
- HAL_RNG_GetUserData() retrieve the user data pointer from the handle.
  */
/**
  * @brief Store the user data into the RNG handle.
  * @param hrng        pointer to @ref hal_rng_handle_t structure.
  * @param p_user_data pointer to the user data.
  */
void HAL_RNG_SetUserData(hal_rng_handle_t *hrng, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hrng != NULL);
  ASSERT_DBG_PARAM(p_user_data != NULL);

  hrng->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data from the RNG handle.
  * @param  hrng Pointer to RNG handle.
  * @retval Pointer to the user data.
  */
const void *HAL_RNG_GetUserData(const hal_rng_handle_t *hrng)
{
  ASSERT_DBG_PARAM(hrng != NULL);

  return (hrng->p_user_data);
}
/**
  * @}
  */
#endif /* USE_HAL_RNG_USER_DATA */

/** @addtogroup RNG_Exported_Functions_Group7
  * @{
This subsection provides a set of functions to retrieve the state and the error codes
- HAL_RNG_GetState() retrieve the global state of the current RNG peripheral.
- HAL_RNG_GetLastErrorCodes() retrieve the last error code of the RNG peripheral.
  */
/**
  * @brief  Return the RNG state.
  * @param  hrng pointer to @ref hal_rng_handle_t structure.
  * @retval hal_rng_state_t RNG global state.
  */
hal_rng_state_t HAL_RNG_GetState(const hal_rng_handle_t *hrng)
{
  ASSERT_DBG_PARAM(hrng != NULL);

  return (hrng->global_state);
}

#if defined(USE_HAL_RNG_GET_LAST_ERRORS) && (USE_HAL_RNG_GET_LAST_ERRORS == 1)
/**
  * @brief  Return the RNG handle error code.
  * @param  hrng pointer to @ref hal_rng_handle_t structure.
  * @retval uint32_t RNG last error codes.
  */
uint32_t HAL_RNG_GetLastErrorCodes(const hal_rng_handle_t *hrng)
{
  ASSERT_DBG_PARAM(hrng != NULL);

  return (hrng->last_error_codes);
}
#endif /* USE_HAL_RNG_GET_LAST_ERRORS */
/**
  * @}
  */

/** @addtogroup RNG_Exported_Functions_Group8
  * @{
This subsection provides a set of functions to lock RNG configuration.
- HAL_RNG_LockConfig() locks the RNG configuration.
- HAL_RNG_IsConfigLocked() checks whether the RNG peripheral configuration is locked.
  */
/**
  * @brief   Lock the current RNG configuration.
  * @param   hrng              pointer to @ref hal_rng_handle_t structure.
  * @warning This function locks the RNG peripheral configuration. Once locked, perform a system reset or RNG
  *          peripheral reset through RCC before any further configuration update.
  * @retval  HAL_OK            configuration locked successfully.
  * @retval  HAL_INVALID_PARAM invalid parameter.
  * @retval  HAL_TIMEOUT operation exceeds the config lock timeout.
  */
hal_status_t HAL_RNG_LockConfig(hal_rng_handle_t *hrng)
{
  uint32_t tickstart;

  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hrng == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  tickstart = HAL_GetTick();
  while (LL_RNG_IsConfigLocked(RNG_GET_INSTANCE(hrng)) == 0U)
  {
    LL_RNG_ConfigLock(RNG_GET_INSTANCE(hrng));

    /* Check for the timeout */
    if ((HAL_GetTick() - tickstart) > RNG_CONFIGLOCK_TIMEOUT_MS)
    {
      hrng->global_state = HAL_RNG_STATE_IDLE;
      return HAL_TIMEOUT;
    }
  }
  hrng->global_state = HAL_RNG_STATE_IDLE;
  return HAL_OK;
}

/**
  * @brief  Check if RNG Config Lock is enabled.
  * @param  hrng pointer to @ref hal_rng_handle_t structure.
  * @retval hal_rng_lock_config_status_t  RNG lock config state.
  */
hal_rng_lock_config_status_t HAL_RNG_IsConfigLocked(const hal_rng_handle_t *hrng)
{
  ASSERT_DBG_PARAM(hrng != NULL);

  ASSERT_DBG_STATE(hrng->global_state, (uint32_t)HAL_RNG_STATE_IDLE | (uint32_t) HAL_RNG_STATE_ACTIVE \
                   | (uint32_t) HAL_RNG_STATE_ERROR);

  return ((hal_rng_lock_config_status_t) LL_RNG_IsConfigLocked(RNG_GET_INSTANCE(hrng)));
}
/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup RNG_Private_Functions RNG Private Functions
  * @{
  */
/**
  * @brief Wait for a flag state until timeout in non-blocking mode.
  * @param  hrng      pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK    operation completed successfully.
  * @retval HAL_TIMEOUT operation exceeds the conditioning reset timeout.
  */
static hal_status_t RNG_WaitOnFlagUntilTimeout(hal_rng_handle_t *hrng)
{
  uint32_t tickstart;

  tickstart = HAL_GetTick();
  while (LL_RNG_IsEnabledCondReset(RNG_GET_INSTANCE(hrng)) != 0U)
  {
    /* Check for the timeout */
    if ((HAL_GetTick() - tickstart) > RNG_CONDRST_TIMEOUT_MS)
    {
      hrng->global_state = HAL_RNG_STATE_IDLE;
      return HAL_TIMEOUT;
    }
  }

  hrng->global_state = HAL_RNG_STATE_IDLE;
  return HAL_OK;
}
/**
  * @brief Wait for a BUSY flag until timeout in non-blocking mode.
  * @param  hrng      pointer to @ref hal_rng_handle_t structure.
  * @retval HAL_OK    operation completed successfully.
  * @retval HAL_TIMEOUT operation exceeds the busy flag timeout.
  */
static hal_status_t RNG_WaitOnBusyFlagUntilTimeout(hal_rng_handle_t *hrng)
{
  uint32_t tickstart = HAL_GetTick();

  while (LL_RNG_IsActiveFlag_BUSY(RNG_GET_INSTANCE(hrng)) != 0U)
  {
    /* Check for the timeout */
    if ((HAL_GetTick() - tickstart) > RNG_BUSY_TIMEOUT_MS)
    {
      return HAL_TIMEOUT;
    }
  }
  return HAL_OK;
}
/**
  * @}
  */

#endif /* USE_HAL_RNG_MODULE */
/**
  * @}
  */

/**
  * @}
  */
